## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.acr.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "switzerlandnorth"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "huggingface-dev"
      + sku                           = "Standard"
      + tags                          = {
          + "environment" = "dev"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # module.aks.azurerm_kubernetes_cluster.this will be created
  + resource "azurerm_kubernetes_cluster" "this" {
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "huggingfaceaks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.31"
      + location                            = "switzerlandnorth"
      + name                                = (known after apply)
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "huggingface-dev"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "dev"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile {
          + balance_similar_node_groups                   = true
          + daemonset_eviction_for_empty_nodes_enabled    = false
          + daemonset_eviction_for_occupied_nodes_enabled = true
          + empty_bulk_delete_max                         = (known after apply)
          + expander                                      = "random"
          + ignore_daemonsets_utilization_enabled         = false
          + max_graceful_termination_sec                  = (known after apply)
          + max_node_provisioning_time                    = "15m"
          + max_unready_nodes                             = 3
          + max_unready_percentage                        = 45
          + new_pod_scale_up_delay                        = (known after apply)
          + scale_down_delay_after_add                    = "10m"
          + scale_down_delay_after_delete                 = (known after apply)
          + scale_down_delay_after_failure                = (known after apply)
          + scale_down_unneeded                           = "10m"
          + scale_down_unready                            = (known after apply)
          + scale_down_utilization_threshold              = (known after apply)
          + scan_interval                                 = (known after apply)
          + skip_nodes_with_system_pods                   = true
        }

      + default_node_pool {
          + auto_scaling_enabled         = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 1
          + max_pods                     = (known after apply)
          + min_count                    = 1
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.31"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_B2s"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)

          + upgrade_settings {
              + max_surge = "10%"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 0,
                  + 1,
                  + 2,
                ]
            }
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip     = "10.0.3.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.0.3.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.userpool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "userpool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 1
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "userpool"
      + node_count            = (known after apply)
      + node_labels           = {
          + "agentpool" = "userpool"
        }
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_A8m_v2"
      + vnet_subnet_id        = (known after apply)
    }

  # module.aks.azurerm_monitor_data_collection_endpoint.prometheus will be created
  + resource "azurerm_monitor_data_collection_endpoint" "prometheus" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "switzerlandnorth"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "prometheus-dce-dev"
      + public_network_access_enabled = true
      + resource_group_name           = "huggingface-dev"
    }

  # module.aks.azurerm_monitor_data_collection_rule_association.prometheus will be created
  + resource "azurerm_monitor_data_collection_rule_association" "prometheus" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association between AKS cluster and Prometheus DCR"
      + id                      = (known after apply)
      + name                    = "prometheus-dcra-dev"
      + target_resource_id      = (known after apply)
    }

  # module.grafana.azurerm_dashboard_grafana.this will be created
  + resource "azurerm_dashboard_grafana" "this" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "switzerlandnorth"
      + name                                   = "grafana-dev"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "huggingface-dev"
      + sku                                    = "Standard"
      + tags                                   = {
          + "environment" = "dev"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.grafana.azurerm_role_assignment.grafana_subscription_reader will be created
  + resource "azurerm_role_assignment" "grafana_subscription_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.grafana.null_resource.grafana_role_assignment will be created
  + resource "null_resource" "grafana_role_assignment" {
      + id = (known after apply)
    }

  # module.log_analytics.azurerm_log_analytics_solution.containers will be created
  + resource "azurerm_log_analytics_solution" "containers" {
      + id                    = (known after apply)
      + location              = "switzerlandnorth"
      + resource_group_name   = "huggingface-dev"
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.log_analytics.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "switzerlandnorth"
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "huggingface-dev"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "dev"
        }
      + workspace_id                    = (known after apply)
    }

  # module.log_analytics.azurerm_monitor_data_collection_rule.prometheus will be created
  + resource "azurerm_monitor_data_collection_rule" "prometheus" {
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "prometheus-dcr-dev"
      + resource_group_name = "huggingface-dev"

      + data_flow {
          + destinations = [
              + "monitorAccount",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "monitorAccount"
            }
        }
    }

  # module.log_analytics.azurerm_monitor_workspace.prometheus will be created
  + resource "azurerm_monitor_workspace" "prometheus" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "switzerlandnorth"
      + name                                = "prometheus-dev"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "huggingface-dev"
    }

  # module.log_analytics.azurerm_role_assignment.aks_prometheus will be created
  + resource "azurerm_role_assignment" "aks_prometheus" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.resource_group.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "switzerlandnorth"
      + name     = "huggingface-dev"
      + tags     = {
          + "environment" = "dev"
        }
    }

  # module.storage.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "switzerlandnorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "huggingface-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "dev"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage.azurerm_storage_share.this will be created
  + resource "azurerm_storage_share" "this" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "modeldata"
      + quota               = 300
      + resource_manager_id = (known after apply)
      + storage_account_id  = (known after apply)
      + url                 = (known after apply)
    }

  # module.vnet.azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = (known after apply)
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "huggingface-dev"
      + service_endpoints                             = [
          + "Microsoft.AzureCosmosDB",
        ]
      + virtual_network_name                          = (known after apply)
    }

  # module.vnet.azurerm_subnet.cosmosdb will be created
  + resource "azurerm_subnet" "cosmosdb" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = (known after apply)
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "huggingface-dev"
      + virtual_network_name                          = (known after apply)
    }

  # module.vnet.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "switzerlandnorth"
      + name                           = (known after apply)
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "huggingface-dev"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "dev"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_admin_password          = (sensitive value)
  + acr_admin_username          = (known after apply)
  + acr_login_server            = (known after apply)
  + acr_name                    = (known after apply)
  + aks_cluster_kube_config     = (sensitive value)
  + grafana_endpoint            = (known after apply)
  + resource_group              = {
      + id       = (known after apply)
      + location = "switzerlandnorth"
      + name     = "huggingface-dev"
    }
  + storage_account_name        = (known after apply)
  + storage_account_primary_key = (sensitive value)
  + virtual_network             = {
      + aks_subnet_id      = (known after apply)
      + cosmosdb_subnet_id = (known after apply)
      + virtual_network_id = (known after apply)
    }
```
</details>